{
  "notes": [
    {
      "note_id": 1,
      "note_text": "EMERGENCY DEPARTMENT NOTE\n\nChief Complaint: Left facial droop and slurred speech\n\nHPI: Patient presented to the ED with sudden onset of left facial droop and slurred speech beginning approximately 2 hours prior to arrival. CT head showed no acute bleed. NIHSS score 6 on presentation. Given symptom onset within window, stroke code activated. Admitted to neurology service for management of acute ischemic stroke and further evaluation of underlying etiology.\n\nAssessment: CT head negative for acute hemorrhage, but symptoms persist with left facial droop and dysarthria. Given unclear onset time and lack of clear etiology, MRI brain with diffusion-weighted imaging is urgently indicated to confirm acute ischemic changes, define infarct territory, and guide secondary prevention strategy. Results will directly impact management and disposition planning.\n\nVital Signs: BP 158/92, HR 78, RR 16, Temp 98.4F, SpO2 98% on RA\n\nPlan:\n- Admit to stroke unit\n- Neurology consult\n- Urgent MRI brain with DWI\n- Telemetry monitoring\n- ASA 325mg\n- NPO pending swallow evaluation\n\nDisposition: Admitted to 5 West Neurology",
      "type": "Emergency Department Note",
      "clinical_service": "Emergency Medicine",
      "timestamp": "2025-10-29T14:30:00"
    },
    {
      "note_id": 2,
      "note_text": "NEUROLOGY PROGRESS NOTE - Hospital Day 2\n\nSubjective: Patient reports mild improvement in speech. Denies headache, vision changes, or new weakness.\n\nObjective: \nVitals: BP 142/84, HR 72, Temp 98.2F\nNeuro exam: Mild left facial droop persists, mild dysarthria, strength 5/5 all extremities, sensation intact\n\nAssessment/Plan:\nPatient is a 66-year-old man with hypertension and hyperlipidemia admitted for evaluation of acute ischemic stroke. MRI confirms a small right MCA territory infarct without large-vessel occlusion. Cardiac echo and telemetry to date show no atrial fibrillation or thrombus. No clear embolic source identified; picture consistent with cryptogenic stroke. Neurology following, secondary prevention initiated with aspirin and high-intensity statin.\n\nGiven cryptogenic stroke with no large-vessel source identified, cardiac evaluation is essential to rule out embolic etiology. TTE should be obtained as a first-line study to assess LV function, wall motion abnormalities, and possible intracardiac thrombus. Results will determine need for TEE to further evaluate for patent foramen ovale (PFO), atrial septal aneurysm, or valvular source.\n\nPlan:\n- Continue aspirin 81mg daily\n- Start atorvastatin 80mg daily\n- TTE ordered for tomorrow\n- Continue telemetry\n- PT/OT consults\n- Dietary consult for stroke prevention\n\n- Dr. Sarah Chen, Neurology",
      "type": "Progress Note",
      "clinical_service": "Neurology",
      "timestamp": "2025-10-30T09:15:00"
    },
    {
      "note_id": 3,
      "note_text": "CARDIOLOGY CONSULT NOTE - Hospital Day 3\n\nReason for Consult: Cryptogenic stroke, evaluation for cardiac source\n\nHPI: 66M with HTN, HLD admitted with acute ischemic stroke (right MCA territory). TTE completed today showing normal LV function, EF 60%, no wall motion abnormalities, no thrombus visualized. No valvular abnormalities noted.\n\nTelemetry Review: Continuous monitoring since admission. Normal sinus rhythm throughout. No atrial fibrillation documented to date.\n\nAssessment: Patient with cryptogenic stroke—no atrial fibrillation noted on telemetry thus far. Ambulatory ECG monitoring (Zio patch) indicated to evaluate for paroxysmal AF as potential embolic source. This should be initiated prior to discharge given that placement services are unavailable over the weekend. If not arranged before Friday afternoon, discharge will likely be delayed until Monday.\n\nRecommendations:\n- Continue aspirin\n- Consider ambulatory ECG monitoring (Zio patch) for 2 weeks post-discharge to evaluate for paroxysmal AF\n- Order needs to be placed by Friday for weekend discharge\n- If Zio not arranged, may need TEE to further evaluate for PFO/ASA\n- Follow up in cardiology clinic in 4 weeks\n\n- Dr. Michael Torres, Cardiology",
      "type": "Consult Note",
      "clinical_service": "Cardiology",
      "timestamp": "2025-10-30T16:45:00"
    },
    {
      "note_id": 4,
      "note_text": "CASE MANAGEMENT / SOCIAL WORK NOTE - Hospital Day 3\n\nPsychosocial Assessment:\nMet with patient at bedside to discuss discharge planning needs. Patient is a 66-year-old man who lives alone in an upstairs apartment. Two adult children listed as contacts: Son: Alex Rivera – Mobile: (555) 016-4823. Daughter: Taylor Rivera – Mobile: (555) 017-9360. Both children work full-time and live approximately 30 minutes away.\n\nFunctional Status:\nPrior to admission, patient was independent with all ADLs and IADLs. Post-stroke, patient demonstrates mild left-sided weakness and requires minimal assistance with transfers and bathing. PT/OT evaluating.\n\nDischarge Planning:\nPatient lives alone in an upstairs apartment and will require assistance with ADLs following discharge. IHSS referral initiated today for caregiver support with bathing, meal prep, and medication reminders. Patient educated on application process; form SOC 873 completed and submitted. Anticipate 2–3 week approval lag, so temporary family support will be needed at discharge. IHSS services will be essential to maintain safety and prevent readmission.\n\nTransportation:\nPatient reports no personal vehicle and limited family support for transportation. Will require assistance arranging rides to follow-up appointments with neurology and primary care. CM discussed options including Paratransit, IHSS escort, and Medi-Cal–covered medical transport. Transportation referral submitted today to ensure continuity of care; delay in securing reliable transport may impact ability to attend post-stroke follow-up within recommended timeframe.\n\nFamily Meeting:\nMet with both children at bedside. Discussed discharge plan, IHSS application, and need for temporary support. Family agrees to rotate staying with patient for first 2-3 weeks post-discharge until IHSS services begin. Will provide medication management and assist with appointments.\n\nPlan:\n- IHSS application submitted\n- Medical transportation referral submitted\n- DME: shower chair, grab bars ordered\n- Follow-up appointments scheduled\n- Discharge anticipated Friday pending Zio patch order\n- Family education on stroke warning signs completed\n\n- Jennifer Martinez, LCSW, Case Manager",
      "type": "Case Management Note",
      "clinical_service": "Social Services",
      "timestamp": "2025-10-31T10:30:00"
    }
  ]
}