{
  "notes": [
    {
      "timestamp": "2023-09-27 12:39:00",
      "text": "Situation: The patient is admitted due  Pneumonia [J18.9], COPD exacerbation (CMS/HCC) [J44.1], and Pneumothorax [J93.9]. Informants for the interview include the patient and chart review. The reason for SW intervention is the discharge plan.\n  Background: The patient lives alone in a house/apartment. She has Medicare Part B only and is enrolled in a local health plan. The patient receives 156 hours and 36 minutes per month of In-Home Supportive Services (IHSS).\n  Assessment: The medical team has medically cleared the patient for discharge today. SW contacted the patient’s IHSS social worker to inform them of the patient’s return home and requested the resumption of IHSS services. A wheelchair van has been scheduled for pick-up today at 4:00 PM to transport the patient home. The medical provider has ordered a hospital bed for the patient, with the order submitted to a healthcare supplier for fulfillment and coordination with the patient’s family member. Additionally, an order for a power wheelchair has been submitted to a local wheelchair supplier, with a request for follow-up with the patient’s primary care provider for any necessary documentation. The local wheelchair supplier reported that the patient received a power wheelchair in 2021 from another supplier. SW also contacted Adult Protective Services (APS) to inform them of the patient’s discharge plan and left a voice message.\n  Recommendation: The patient is to be discharged home with the resumption of IHSS and home health services. The anticipated necessary steps for discharge to occur include the arrival of transportation. The patient and family are agreeable to the discharge plan.\n  ",
      "type": "Consults",
      "clinical_service": "Social Work",
      "note_id": 2
    },
    {
      "timestamp": "2023-09-25 12:39:00",
      "text": "Situation: The patient is admitted due to Pneumonia [J18.9], COPD exacerbation (CMS/HCC) [J44.1], and Pneumothorax [J93.9]. Informants for the interview include the patient and chart review. The reason for SW intervention is to facilitate SNF placement.\n  Background: The patient lives alone in a house/apartment. She reports smoking cigarettes for approximately 55 years, with a 13.25 pack-year history, and has never used smokeless tobacco. The patient reports use of fentanyl and is open to receiving medication treatment to support recovery from substance use.\n  Assessment: An OT evaluation for SNF placement is pending, as is a PT evaluation for Home Health (HH), with updates forthcoming. SW spoke to the patient at bedside regarding SNF options, providing a list of qualifying facilities with quality data to aid in decision-making. The patient was informed that bed availability at discharge will impact the final decision. The patient is to review SFHP options and requested that SW include her family in the discussion. SW emailed the list of SNF options and communicated with the family by phone. The patient expressed a preference for returning to VPA or considering Pacific Heights. According to the SFHP liaison, potential bed availability may be confirmed on Monday. The patient reports feeling too weak or tired to transfer today. Follow-up with SW is planned for Monday regarding referral preferences. The team has been updated on the situation.\n  Additional Concerns: SW requested the medical team provide more information regarding current APS concerns about the family administering unprescribed medications to the patient. The medical team will clarify the situation with the family and provide more context and details about the medications. SW advised the team to consider reporting directly to APS due to the medical nature of the concern and will follow up with APS as needed to ensure a safe discharge.\n  Recommendation: SW will follow up with SNF referrals\n  ",
      "type": "Consults",
      "clinical_service": "Social Work",
      "note_id": 1
    }
  ]
}
