{
  "notes": [
    {
      "timestamp": "2023-10-15 14:22:00",
      "text": "Situation: The patient is a 78-year-old female admitted with Congestive Heart Failure exacerbation [I50.9], Hypertension [I10], and Type 2 Diabetes Mellitus [E11.9]. Information sources include the patient, her niece (secondary caregiver), and chart review. SW intervention requested to address discharge planning needs and social support concerns.\n  Background: The patient lives alone in a second-floor apartment with no elevator. She has Medicare Parts A and B and recently lost supplemental coverage due to missed premium payments. The patient reports skipping meals due to inability to shop for or prepare food. She relies heavily on pre-packaged meals and has lost 10 pounds in the last 3 months.\n  Assessment: The patient has been medically cleared for discharge tomorrow with home health services. SW completed and submitted a referral to Meals on Wheels. Program representative confirmed eligibility and stated service can begin within 5-7 business days. SW will compile and send a list of neighborhood food banks and pantries with contact information and service hours. SW provided patient with hospital financial assistance application and reviewed eligibility requirements. Patient began completing application with SW assistance. SW will schedule patient for consultation with hospital financial counselor to review Medicare Part D prescription options during open enrollment period. SW completed application for senior transportation program that provides door-to-door service for medical appointments. Program typically takes 2 weeks for approval. SW will refer patient to community care coordination program for ongoing assistance with appointment scheduling, reminders, and transportation arrangements. SW will follow up with patient after discharge to evaluate if an electronic medication reminder system would be beneficial and explore coverage options.\n  Recommendation: Patient to be discharged home tomorrow with home health services for physical therapy and medication management. Transportation has been arranged through hospital service. The patient and her niece understand and agree with the discharge plan. Follow-up phone call scheduled for one week post-discharge to assess progress with implemented interventions.\n  ",
      "type": "Consults",
      "clinical_service": "Social Work",
      "note_id": 2
    },
    {
      "timestamp": "2023-10-12 10:15:00",
      "text": "Situation: The patient is a 78-year-old female admitted for Congestive Heart Failure exacerbation [I50.9], Hypertension [I10], and Type 2 Diabetes Mellitus [E11.9]. Information obtained from patient interview and chart review. SW consultation requested to assess discharge planning needs.\n  Background: The patient is widowed and lives alone in a second-floor apartment. She has one daughter who lives out of state and a niece who checks on her weekly. The patient disclosed confusion with medication regimen following recent prescription changes. She reports missing afternoon doses approximately 3-4 times per week. The patient expressed significant concern about mounting medical bills, stating she is using credit cards to pay for medications and has delayed filling some prescriptions due to cost.\n  Assessment: Initial evaluation indicates the patient will likely return home with enhanced support services. PT/OT evaluations are pending to determine specific home health needs. SW contacted patient's pharmacy to arrange for medication review, blister pack organization, and potential delivery options. Pharmacy will call patient directly to set up service. The patient acknowledges needing additional support but is resistant to moving from her current residence. SW discussed community-based services including home-delivered meals, transportation assistance, and medication management options. The patient appears open to these interventions.\n  Plan: SW will follow up regarding PT/OT recommendations and coordinate appropriate home health services. Additional assessment needed for nutritional support and transportation needs. Medication reconciliation to be completed before discharge. SW will investigate financial assistance options for medical expenses and prescription costs. Will continue to work with patient on acceptance of additional in-home support services.\n  ",
      "type": "Consults",
      "clinical_service": "Social Work",
      "note_id": 1
    }
  ]
}
